Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-38-42.tmx
Source language: bo
Languages: en

source: དེའི་བར་སྐབས་སུ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་སྟོང་ཕྲག་བཅུ་ཡོངས་སུ་བསྒྲུབས་སོ། །གཟུངས་ཀྱི་སྒོ་སྟོང་ཕྲག་བཅུ་ཡང་རབ་ཏུ་ཐོབ་པོ། །མངོན་པར་ཤེས་པའི་ཚུལ་སྟོང་ཕྲག་བཅུ་ལའང་རབ་ཏུ་ཞུགས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་གཏེར་སྟོང་ཕྲག་བཅུའང་རབ་ཏུ་ཐོབ་བོ། །ཐམས་ཅད་མཁྱེན་པའི་ཤུགས་སྟོང་ཕྲག་བཅུའང་ཡོངས་སུ་སྐྱེས་སོ། །བཟོད་པའི་སྒོ་སྟོང་ཕྲག་བཅུ་ཡང་ཡོངས་སུ་སྦྱངས་སོ། །སེམས་ངེས་པར་བཞག་པ་སྟོང་ཕྲག་བཅུ་ཡང་མངོན་པར་བསྒྲུབས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་ཀྱི་ལུས་སྟོང་ཕྲག་བཅུ་ཡང་ཡོངས་སུ་སྤེལ་ཏོ། །བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་སྒོ་སྟོང་ཕྲག་བཅུར་ཡང་རབ་ཏུ་ཞུགས་སོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་སྟོང་ཕྲག་བཅུ་ཡང་ཡོངས་སུ་སྐྱེས་སོ། །སངས་རྒྱས་བལྟ་བའི་ཕྱོགས་ཀྱི་སྒོ་སྟོང་ཕྲག་བཅུ་ཡང་མངོན་དུ་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་སྟོང་ཕྲག་བཅུ་ཡང་མངོན་པར་བསྒྲུབས་སོ།
en: “During that time he accomplished ten thousand gateways into samādhi, he attained ten thousand gateways into the power of mental retention, he entered ten thousand ways of higher cognition, he attained ten thousand bodhisattva treasures, he developed ten thousand powers of omniscience, he purified ten thousand gateways into patience, he accomplished ten thousand realizations through contemplation, he multiplied ten thousand bodies with the strengths of a bodhisattva, he entered ten thousand gateways into the knowledge of a bodhisattva, he developed ten thousand ways of the perfection of wisdom, he perceived ten thousand gateways for looking at the buddhas in the directions, and he accomplished ten thousand bodhisattva prayers.

source: །དེ་དེ་ལྟ་བུའི་ཆོས་དང་ལྡན་པས་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཕྱོགས་བཅུར་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུ་ཡོངས་སུ་གནོན་ཏོ།
en: “Possessing such qualities in each instant of mind, he could arrive in ten thousand buddha realms.

source: །འཇིག་རྟེན་གྱི་ཁམས་རེ་རེ་ཞིང་ཡང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་སངས་རྒྱས་སྟོང་ཕྲག་བཅུ་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་རྗེས་སུ་དྲན་ནོ།
en: In each world realm, in each instant of mind, he could remember ten thousand past and future buddhas.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་སངས་རྒྱས་ཀྱི་སྤྲུལ་པ་རྒྱ་མཚོ་སྟོང་ཕྲག་བཅུ་ཕྱོགས་བཅུར་གཤེགས་པ་དེ་དག་ཀྱང་མཐོང་ཞིང་ཤེས་སོ།
en: He could see and know ten thousand oceans of emanations from each of those buddhas going into the ten directions.

source: །སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུར་གཏོགས་པའི་སེམས་ཅན་འགྲོ་བའི་རྒྱུད་སྣ་ཚོགས་སུ་སྐྱེས་པ་ཤི་འཕོ་ཞིང་སྐྱེ་བར་འགྱུར་བ་མཐོ་བ་དང་། དམའ་བ་དང་། བདེ་འགྲོའི་ལམ་དུ་ཕྱིན་པ་དང་། ངན་སོང་གི་ལམ་དུ་ཕྱིན་པ་དང་། ཁ་དོག་སྡུག་པ་དང་། ཁ་དོག་མྱི་སྡུག་པ་ལས་ཇི་བཞིན་དུ་སྐྱེས་པར་གྱུར་པ་ཐམས་ཅད་ཀྱང་མཐོང་བར་གྱུར་ཏོ།
en: “In each instant of mind, he could see all the beings within those ten thousand buddha realms. He knew their birth into various existences, their passing away and their rebirths, their decline, their ascent, their going on the path to happy existences, their going on the path to lower existences, their having a beautiful color, and their having a bad color, exactly as they were born.

source: །སེམས་ཅན་དེ་དག་གི་ཤི་འཕོ་དང་སྐྱེ་བ་ཡང་ཁོང་དུ་ཆུད་ཅིང་མཐོང་སྟེ། སེམས་ཀྱི་རྒྱུད་དང་། སེམས་ཀྱི་སྤྱོད་པ་དང་། སེམས་ཀྱི་འདབ་འབྲེལ་བ་དང་། བསམ་པ་སྣ་ཚོགས་དང་། དབང་པོ་རྒྱ་མཚོ་དང་། སྦྱོར་བ་འབྱམ་ཀླས་པ་དང་། ལས་མཐར་ཐུག་པ་དང་། ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། རྣམ་པར་གདུལ་བའི་དུས་ཀྱང་ཁོང་དུ་ཆུད་ཅིང་མཐོང་ངོ་།
en: “He saw the passing away and the rebirth of all those beings, and he saw and knew their movements of mind, the conduct of their minds, the continuation of their minds, their various thoughts, their ocean of faculties, the vast extent of their activities, the conclusion of their karma, and the times for ripening and guiding them.

source: །རིགས་ཀྱི་བུ་རྒྱལ་པོ་གཞོན་ནུ་དེ་དེ་ནས་ཤི་འཕོས་ནས་ཀྱང་འཛམ་བུའི་གླིང་དེ་ཉིད་དུ་རྒྱལ་པོའི་གནས་དགའ་བ་དང་ལྡན་པར་རྒྱལ་པོ་དེ་ཉིད་ཀྱི་རིགས་སུ་སྐྱེས་ནས།
en: “Noble one, when that prince passed away, he was reborn in the family of that king in the royal capital, Rativyūhā, in that Jambudvīpa, and he succeeded to the sovereignty of a cakravartin king.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ཐོབ་པར་གྱུར་ཏོ། །དེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར་པས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མའི་རྒྱལ་པོ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་ནམ་མཁའ་ལ་དཔལ་ཤིན་ཏུ་འཕགས་པའི་རྒྱལ་པོ་བསྙེན་བཀུར་ཏོ།
en: When he had become a cakravartin king, following the parinirvāṇa of the Bhagavat, the Tathāgata Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja, he honored the Tathāgata by the name of Dharma­gaganābhyudgata­śrī­rāja.

source: །དེའི་འོག་ཏུ་སྙིང་པོ་བྱང་ཆུབ་དེ་ཉིད་དུ་བརྒྱ་བྱིན་དུ་གྱུར་ཏེ།
en: “After that, he became a Śakra who at the bodhimaṇḍa honored the Tathāgata by the name of Devendragarbha.

source: །དེ་བཞིན་གཤེགས་པ་ལྷ་དབང་སྙིང་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་རབ་མཚེ་མའི་ལྷའི་རྒྱལ་པོར་གྱུར་ཏེ།
en: “After that, in that world realm he became a Suyāma king of devas who honored the Tathāgata by the name of Dharaṇī­śrī­parvata­tejas.

source: དེ་བཞིན་གཤེགས་པའི་དཔལ་རི་བོའི་གཟི་བརྗིད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་རབ་དགའ་ལྡན་གྱི་ལྷའི་རྒྱལ་པོར་གྱུར་ཏེ།
en: “After that, in that world realm he became a Saṃtuṣita king of devas who honored the Tathāgata by the name of Dharma­cakra­prabha­nirghoṣa­rāja.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོའི་འོད་རབ་ཏུ་བསྒྲགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་རབ་འཕྲུལ་དགའི་ལྷའི་རྒྱལ་པོར་གྱུར་ཏེ།
en: “After that, in that world realm he became a Sunirmita king of devas who honored the Tathāgata by the name of Gagana­kānta­rāja.

source: དེ་བཞིན་གཤེགས་པ་ནམ་མཁའ་མཛེས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་དབང་བསྒྱུར་གྱི་ལྷའི་རྒྱལ་པོར་གྱུར་ཏེ།
en: “After that, in that world realm he became a Vaśavartin king of devas who honored the Tathāgata by the name of Anavamarda­bala­ketu.

source: དེ་བཞིན་གཤེགས་པ་སྟོབས་ལ་ཐུབ་པ་མྱེད་པའི་དཔལ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་ལྷ་མ་ཡིན་གྱི་དབང་བོར་གྱུར་ཏེ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཐམས་ཅད་ཀྱི་འབྲུག་སྒྲ་བསྒྲགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “After that, in that world realm he became an asura lord who honored the Tathāgata by the name of Sarva­dharma­nigarjita­rāja.

source: །དེའི་འོག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་ཚངས་པའི་དབང་པོར་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོ་སྤྲུལ་པ་ཀུན་ཏུ་སྣང་བའི་དབྱངས་ཤེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “After that, in that world realm he became a Brahmā lord who honored the Tathāgata by the name of Dharma­cakra­nirmāṇa­samanta­pratibhāsa­nirghoṣa.

source: །རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་རིན་ཆེན་འོད་དེ་ཉིད་དུ་བསྐལ་པ་འོད་བཟང་པོ་དེ་ཉིད་ལ་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་སྩོགས་པ། སངས་རྒྱས་སྟོང་ཕྲག་བཅུ་བྱུང་སྟེ།
en: “Noble one, there were those and the rest of the ten thousand buddhas who appeared in that world realm of Ratnaprabhā during the Suprabha kalpa.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བས་བསྙེན་བཀུར་ཏོ།
en: Prince Vijitāvin honored all those tathāgatas.

source: །རིགས་ཀྱི་བུ་བསྐལ་པ་འོད་བཟང་པོ་དེའི་འོག་ཏུ་བསྐལ་བ་འོད་གཟེར་བཟང་པོ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “Noble one, following that Suprabha kalpa arose the kalpa called Suraśmi

source: བསྐལ་པ་འོད་གཟེར་བཟང་པོ་དེ་ལ་ཡང་སངས་རྒྱས་སྟོང་ཕྲག་བཅུ་བྱུང་ངོ་།
en: During that Suraśmi kalpa there were ten thousand buddhas.

source: །ཁོ་མོ་ཡང་བསྐལ་པ་དེ་ལ་རྒྱལ་པོ་བློ་གྲོས་ཆེན་པོ་ཞེས་བྱ་བ་ཞིག་ཏུ་གྱུར་ཏེ།
en: “In that kalpa, I became Mahāmati

source: དེའི་ཚེ་ཁོ་མོ་རྒྱལ་པོར་གྱུར་བས་དེ་བཞིན་གཤེགས་པ་མཚན་གྱི་དཔལ་རི་བོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: During the time when I was King Mahāmati , I honored the Tathāgata by the name of Lakṣaṇa­śrī­parvata.

source: །དེའི་འོག་ཏུ་བསྐལ་བ་དེ་ཉིད་ལ་ཁྱིམ་བདག་ཅིག་ཏུ་གྱུར་ཏེ།
en: “Following that, in that same kalpa, I was a householder and I honored the Tathāgata by the name of Saṃvṛtaskandha.

source: དེ་བཞིན་གཤེགས་པ་ཕུང་པོ་ཡོངས་སུ་གྲུབ་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་བསྐལ་པ་དེ་ཉིད་ལ་བློན་པོ་ཞིག་ཏུ་གྱུར་ཏེ།
en: “Following that, in that same kalpa, I was a minister and I honored the Tathāgata by the name of Vimala­vatsa.

source: དེ་བཞིན་གཤེགས་པ་དྲི་མ་མྱེད་པའི་སྲས་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་བསྐལ་པ་དེ་ཉིད་ལ་ལྷ་མ་ཡིན་གྱི་དབང་པོ་ཞིག་ཏུ་གྱུར་ཏེ།
en: “Following that, in that same kalpa, I was an asura lord and I honored the Tathāgata by the name of Veśadhārin.

source: དེ་བཞིན་གཤེགས་པ་ཤུགས་མངའ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་བསྐལ་པ་དེ་ཉིད་ལ་ཤིང་གི་ལྷ་མོ་ཞིག་ཏུ་གྱུར་ཏེ།
en: “Following that, in that same kalpa, I was a tree goddess and I honored the Tathāgata by the name of Lakṣaṇa­sumeru.

source: དེ་བཞིན་གཤེགས་པ་མཚན་ཉིད་རི་རབ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་བསྐལ་པ་དེ་ཉིད་ལ་དེད་དཔོན་ཞིག་ཏུ་གྱུར་ཏེ།
en: “Following that, in that same kalpa, I was a caravan leader and I honored the Tathāgata by the name of Vimala­bāhu.

source: དེ་བཞིན་གཤེགས་པ་ཕྱག་དྲི་མ་མྱེད་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་བསྐལ་པ་དེ་ཉིད་ལ་གྲོང་ཁྱེར་གྱི་ལྷ་མོ་ཞིག་ཏུ་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་སེང་གེ་རྣམ་པར་གནོན་པས་བཞུད་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Following that, in that same kalpa, I was a city goddess and I honored the Tathāgata by the name of Siṃha­vikrānta­gāmin.

source: །དེའི་འོག་ཏུ་བསྐལ་པ་དེ་ཉིད་ལ་ངལ་བསོ་བོ་ཞིག་ཏུ་གྱུར་ཏེ།
en: “Following that, in that same kalpa, I was a Vaiśravaṇa and I honored the Tathāgata by the name of Devendracūḍa.

source: དེ་བཞིན་གཤེགས་པ་ལྷ་དབང་གཙུག་ཕུད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་བསྐལ་པ་དེ་ཉིད་ལ་དྲི་ཟའི་རྒྱལ་པོ་ཞིག་ཏུ་གྱུར་ཏེ།
en: “Following that, in that same kalpa, I was a gandharva king and I honored the Tathāgata by the name of Dharmodgata­kīrti.

source: དེ་བཞིན་གཤེགས་པ་གྲགས་པ་ཆོས་ཀྱིས་འཕགས་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་བསྐལ་པ་དེ་ཉིད་ལ་གྲུལ་བུམ་གྱི་དབང་པོ་ཞིག་ཏུ་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་སྣང་བའི་ཅོད་པན་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Following that, in that same kalpa, I was a kumbhāṇḍa lord and I honored the Tathāgata by the name of Avabhāsa­makuṭin.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་བཅུ་པོ་དེ་དག་ལ་སྩོགས་པ་བསྐལ་པ་འོད་གཟེར་བཟང་པོ་དེ་ལ་སྐྱེ་བའི་རིགས་སྣ་ཚོགས་སུ་སྐྱེས་ནས།
en: “Noble one, in that way, I honored those ten tathāgatas and all the others.

source: དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་བསྙེན་བཀུར་ཏེ། ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལ་མཆོད་པ་བྱས་སོ།
en: I was reborn in various existences in the Suprabha kalpa and honored six hundred million tathāgatas and made offerings to all those tathāgatas. Whenever I came before each of those tathāgatas, I ripened realms of beings without end or middle for the highest, complete enlightenment.

source: །དེ་བཞིན་གཤེགས་པ་རེ་རེའི་སྤྱན་སྔར་འགྲོ་བའི་ཚེའང་སེམས་ཅན་གྱི་ཁམས་མཐའ་དང་དབུས་མྱེད་པ། བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨྱིན་པར་བྱས་སོ། །དེ་བཞིན་གཤེགས་པ་རེ་རེའི་སྤྱན་སྔར་འགྲོ་བའི་ཚེ་འང་ཏིང་ངེ་འཛིན་གྱི་སྒོ་སྣ་ཚོགས་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །གཟུངས་ཀྱི་སྒོ་སྣ་ཚོགས་དང་། མངོན་པར་བསྒྲུབ་པའི་ཚུལ་སྣ་ཚོགས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་མངོན་པར་བསྒྲུབ་པའི་ཚུལ་སྣ་ཚོགས་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚུལ་རྗེས་སུ་རྟོགས་པར་བྱ་བ་སྣ་ཚོགས་དང་། ཆོས་སྣང་བའི་སྒོ་ཐོབ་པར་བྱ་བའི་ཚུལ་སྣ་ཚོགས་དང་། ཡེ་ཤེས་ཀྱི་ཚུལ་ཁོང་དུ་ཆུད་པར་དཔྱད་པ་རྣམ་པ་སྣ་ཚོགས་དང་། ཕྱོགས་རྒྱ་མཚོ་ལ་འཇུག་པའི་སྣང་བ་སྣ་ཚོགས་དང་། ཞིང་རྒྱ་མཚོ་སྣ་ཚོགས་ལ་འཇུག་ཅིང་ཁོང་དུ་ཆུད་པར་བྱ་བའི་སྣང་བ་སྣ་ཚོགས་དང་། དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོ་མཐོང་བར་བྱ་བ་རྣམ་པར་དམྱིགས་པའི་སྣང་བ་སྣ་ཚོགས་ཀྱང་རབ་ཏུ་ཐོབ་བོ།
en: Whenever I came before each of those tathāgatas, I attained various entrances into samādhis, various entrances into powers of mental retention, various ways of accomplishments, various ways of accomplishing discernments, various realizations of the ways of omniscience, various ways of attaining the entrances to the illumination of the Dharma, various aspects of the analysis that comprehends the ways of knowledge, various illuminations of entering into the ocean of directions, and various illuminations of entering and comprehending the various oceans of realms, and I attained various illuminations of the perception that sees the ocean of tathāgatas.

source: ཡོངས་སུ་གནོན་ཏོ། །རྣམ་པར་དག་གོ །ཡོངས་སུ་རྫོགས་སོ། །ཡོངས་སུ་གནས་པར་གྱུར་ཏོ།
en: I overcame them, purified them, perfected them, and remained in them.

source: །སྐྱེས་སོ། །བྱུང་ངོ་། །རྣམ་པར་འཕེལ་ཏོ། །ཡོངས་སུ་འཕེལ་ཏོ། །རབ་ཏུ་བྱུང་ངོ་།
en: They were born, they arose, they were increased, they were magnified, they arose perfectly, and they arose completely.

source: །རྣམ་པར་བྱུང་ངོ་། །བསྐལ་བ་འོད་གཟེར་བཟང་པོ་དེ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཇི་ལྟར་རིམ་གྲོར་བྱས་པ་དེ་བཞིན་དུ་བསྐལ་པ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དུ། དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་བྱུང་བར་གྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་འཇིག་རྟེན་གྱི་ཁམས། གཞན་ནས་དེ་དག་ཏུ་བྱོན་ཏེ། ཆོས་བསྟན་པར་གྱུར་པའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལས་ཀྱང་ཁོ་མོས་ཆོས་བསྟན་པ་ཐོས་ཏེ།
en: “Just as I attended the tathāgatas in that Suprabha kalpa, during kalpas as numerous as the atoms in all the ocean of world realms, however many tathāgatas appeared, however many tathāgatas came from other world realms, from all those tathāgatas who taught the Dharma, I heard the Dharma that they taught, and having heard it, I possessed it.

source: ཐོས་ནས་ཀྱང་ཡོངས་སུ་བཟུང་ངོ་། །དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། ཁོ་མོས་བསྙེན་བཀུར་ཏོ། །རིམ་གྲོར་བྱས་སོ།
en: I honored all those tathāgatas and served them.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས། དེ་དག་གི་བསྟན་པ་ཡང་ཁོ་མོས་ཡོངས་སུ་བཟུང་ངོ་།
en: I held the teaching of all those buddha bhagavats.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལས་ཀྱང་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དགེ་བའི་རྩ་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་འདི་ཐོབ་པར་བྱ་བའི་ཚུལ་སྣ་ཚོགས་དང་། རྣམ་པར་ཐར་པའི་ཚུལ་གྱི་སྒོ་སྣ་ཚོགས་ཀྱིས་ཐོབ་པར་གྱུར་ཏོ། །དེ་ནས་མཚན་མོའི་ལྷ་མོ་འགྲོ་བ་ཐམས་ཅད་བསྲུང་བའི་སྨོན་ལམ་ལ་བརྩོན་པའི་འོད་ཀྱིས།
en: I obtained from all those tathāgatas various ways for the attainment of this bodhisattva liberation called the origin of the roots of merit that inspire, in accordance with their dispositions, the ripening of all beings , and I obtained various entrances into ways of liberation.”

source: དེའི་ཚེ་རྣམ་པར་ཐར་པའི་ཚུལ་འདི་ཉིད་ཡོངས་སུ་བརྗོད་པ་དང་། ཡོངས་སུ་བསྟན་པའི་ཕྱིར་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Then at that time, the night goddess Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā, in order to describe and teach this liberation, recited these verses to Sudhana, the head merchant’s son. “You, friend, have asked me about

source: བསམ་གྱིས་མྱི་ཁྱབ་རྣམ་ཐར་དམ་པ་འདི། །གྲགས་པ་ཁྱོད་ཀྱིས་བདག་ལ་གང་དྲིས་པ།
en: This inconceivable supreme liberation.

source: །བདེ་བར་གཤེགས་པའི་བྱིན་གྱིས་དེ་བསྟན་ཀྱིས།
en: I shall teach it through the blessing of the Sugata.

source: །མ་ལུས་ཡང་དག་ཇི་བཞིན་བདག་ལས་ཉོན།
en: Listen to me properly and entirely. “There was the beautiful world realm Ratnaprabhā in the past beyond

source: །བསྐལ་པ་བསམ་ཡས་ཡངས་པ་མཐའ་ཡས་པ།
en: Inconceivable, vast, endless kalpas

source: །རྒྱ་མཚོའི་ཞིང་གི་རྡུལ་དང་གྲངས་མཉམ་པ། །དེ་ཀུན་འདས་པའི་སྔ་རོལ་མདངས་དགའ་བའི། །འཇིག་རྟེན་ཁམས་ཤིག་བྱུང་བ་རིན་ཆེན་འོད།
en: As numerous as the atoms in an ocean of buddha realms.

source: །དེ་ཚེ་བསྐལ་པ་བཟང་པོའི་འོད་ཀྱང་བྱུང་།
en: “In that time, there arose the kalpa Suprabha

source: །དེ་ལ་རྒྱལ་བ་དཔག་ཏུ་མྱེད་པ་སྐྱེས།
en: In which countless jinas appeared.

source: །ཐུབ་པའི་དབང་པོ་དེ་དག་ཁོ་མོ་ཡིས།
en: I honored those lords of munis

source: །རྣམ་ཐར་འདི་ལ་བསྒོམ་ཞིང་བསྙེན་བཀུར་ཏོ།
en: And meditated on this liberation.

source: །རྒྱལ་པོའི་གནས་རབ་ཡངས་ཤིང་བཟང་བྱུང་བ།
en: “There was a vast, excellent royal capital,

source: །དེ་ཡི་མྱིང་ནི་དགའ་བས་བརྒྱན་པ་སྟེ།
en: And its name was Rativyūhā.

source: །དེ་ཚེ་སེམས་ཅན་རྣམ་པར་མ་དག་སེམས།
en: At that time, the minds of beings were impure,

source: །མྱི་བཟད་ངན་དུ་སྤྱོད་པ་དེར་བྱུང་གྱུར།
en: And they had dreadfully bad conduct.

source: །དེ་ནི་རྒྱལ་པོ་རྒྱལ་བའི་འོད་བྱུང་སྟེ།
en: “In that time, there was King Jayaprabha,

source: །སེམས་ཅན་དེ་དག་ཆོས་ཀྱིས་བསྐྱང་བ་བྱས།
en: Who governed those beings according to the Dharma.

source: །དེ་ཡི་བུ་ནི་རྣམ་པར་རྒྱལ་བ་སྟེ།
en: His son, named Vijitāvin, was handsome

source: །མཛེས་ཤིང་མཚན་གྱིས་ཡན་ལག་བརྒྱན་པའོ།
en: And adorned by the signs of a great being. “At that time, seeing that the king was executing

source: །གཡོན་ལྡན་སྟོང་ཕྲག་མང་པོ་དེ་དག་ཀྱང་།
en: Those many thousands of criminals,

source: །དེ་ཚེ་རྒྱལ་པོས་གསད་པར་བྱས་མཐོང་ནས། །གཞོན་ནུ་སྙིང་བརྩེ་མྱི་དགའས་ཀུན་ནས་འཁོར།
en: The prince was filled with compassion and sadness,

source: །མྱུར་དུ་དགྱེ་བར་རྒྱལ་པོ་དེ་ལ་གསོལ།
en: And he quickly beseeched the king to release them.

source: །རྒྱལ་པོས་ཐོས་ནས་དེ་ཚེ་བློན་པོ་རྣམས།
en: “When the king had heard him, he gathered together

source: །མ་ལུས་ཀུན་བསྡུས་དེ་ལ་བཀའ་སྩལ་ནས།
en: All his ministers and spoke to them.

source: །ཀུན་གྱིས་དེ་ལ་ཕྱག་བྱས་ཕྱིར་གསོལ་པ།
en: They all bowed down to him and said to him,

source: །དེ་ནི་རྒྱལ་པོ་ཁྱོད་དགྲོངས་ཐབས་གཅིག་ལགས།
en: ‘This is a plan to assassinate you, Your Majesty!’

source: །རྒྱལ་པོ་དེ་ལྟར་ལོག་པར་ཐུགས་བཅུག་ནས།
en: “The king, having this misunderstanding,

source: །སྲས་དེ་གསད་པར་དེ་ཚེ་བྱས་གྱུར་ཀྱང་།
en: At that time ordered the execution of his son.

source: །བདག་སྲོག་ཕངས་པར་མ་བརྩིས་ངོམ་ཟུང་མྱེད། །རྒྱལ་པོའི་སྲས་ཀྱིས་གསད་པར་བྱས་མ་བཏང་།
en: The prince was indifferent to the loss of his own life, And he did not free himself from being executed.

source: །གསད་པར་བྱས་པ་དེ་ཡི་མས་ཐོས་ནས།
en: “When his mother heard that he was to be executed,

source: །རྒྱལ་པོ་དེ་ལ་འཁོར་བཅས་གསོལ་བ་འདེབས།
en: With her entourage she supplicated the king, Asking for permission for the prince to give to the world

source: །དགུང་ཟླ་ཕྱེད་ཅིག་སྦྱིན་པ་མ་ལུས་པར། །འཇིག་རྟེན་སྩོལ་དུ་གཞོན་ནུ་བཏང་བར་གནང་།
en: All that he possessed for the duration of half a month.

source: །རྒྱལ་པོ་དེས་ཀྱང་དེ་ལྟར་གནང་གྱུར་ནས།
en: “The king gave his permission for that to be done,

source: །དེས་ནི་ཅི་འདོད་སྦྱིན་པ་ཡོངས་སུ་བཏང་།
en: And the prince gave away whatever was wanted

source: །ཟླ་བ་ཕྱེད་དུ་ཉིན་མཚན་སྦྱིན་བྱས་གནས། །ཉི་མའི་ཐ་མར་ཚོགས་པར་གྱུར་པ་ཡི།
en: For half a month, day and night, practicing generosity. And on the last day, to a gathering of Jains

source: །ཞགས་པ་འཐུབ་པ་གང་རྣམས་ཅི་འདོད་པ།
en: “He gave whatever they desired,

source: །དེ་ལ་དེ་བྱིན་འཆི་བར་སྟ་གོན་གནས།
en: And having given to them he prepared for death.

source: །རྒྱལ་པོའི་གནས་དེར་འགྲོ་བ་མང་པོ་དག །ཆོ་ངེར་ངུ་ཞིང་ཀུན་ཀྱང་འདུས་པར་གྱུར།
en: A multitude of beings wailing and weeping Gathered together at the royal capital.

source: །བྱང་ཆུབ་ཤིང་དྲུང་བདེ་གཤེགས་དེ་ཡི་ཚེ།
en: “At that time, there sat at the foot of a Bodhi tree

source: །དམ་ཆོས་དབྱངས་མཆོག་སྒྲོན་མའི་རྒྱལ་བཞུགས་པས།
en: The Sugata Saddharma­ghoṣāmbara­dīpa­rāja.

source: །འགྲོ་བའི་དབང་པོ་སྨྱིན་པར་ཐུགས་ཆུད་ནས།
en: That lord of beings knew it was time to ripen them,

source: །མཆོད་སྦྱིན་ར་བར་ཐུགས་རྗེ་ཆེན་པོས་བྱོན།
en: And with great compassion he came to the place where gifts were given. “The Tathāgata came to that gathering

source: །དེ་བཞིན་གཤེགས་པའི་རྣམ་འཕྲུལ་རྣམ་ཕྱེ་བས།
en: Through his miraculous powers,

source: །དེ་ཡི་འཁོར་དུ་བདེ་གཤེགས་བྱོན་གྱུར་ནས།
en: And the Sugata taught the king of sūtras,

source: །ཆོས་ཀྱི་སྒྲོན་མེའི་སྤྲིན་གྱི་སྒྲ་སྒྲོག་པའི། །མདོ་སྡེའི་རྒྱལ་པོ་བདེ་བར་གཤེགས་པས་བཤད།
en: The sound of the Dharma as a cloud of lamps of the Dharma.

source: །འགྲོ་བ་མཐའ་དང་དབུས་མྱེད་རྣམ་བཏུལ་ནས།
en: “He guided beings without end or middle

source: །དེ་ཚེ་བྱང་ཆུབ་མཆོག་ཏུ་ལུང་ཡང་བསྟན།
en: And at that time gave prophecies of enlightenment.

source: །རྒྱལ་པོའི་སྲས་པོ་རྣམ་པར་རྒྱལ་བ་ཡང་། །ཤིན་ཏུ་དགའ་བས་བྱང་ཆུབ་མཆོག་ཏུ་ཞུགས།
en: The son of the king, Vijitāvin, was overjoyed And entered upon attaining the supreme enlightenment.

source: །བདེ་གཤེགས་བསྙེན་བཀུར་མཆོད་པ་རྣམས་ཡངས་པས།
en: “He offered to the Sugata vast honors and offerings,

source: །དེ་ལ་མཆོད་བྱས་དགའ་བར་སྨྲས་པ་ནི།
en: And with joy he said these words:

source: །འགྲོ་བ་རྣམ་འདུལ་སྐྱབས་སུ་བདག་འགྱུར་གྱི།
en: ‘May I become for beings a sanctuary, a guide,

source: །མགོན་དང་གནས་དང་དཔུང་དུའང་དེ་བཞིན་ཞེས།
en: A protector, a refuge, and a defender.’

source: །རྒྱལ་བ་དེ་ཡི་ཞམ་རིང་ཐར་བར་ཞུགས།
en: “He became a mendicant under that muni

source: །ཡང་དག་བྱང་ཆུབ་ལམ་ནི་ཡོངས་ཚོལ་ཞིང་།
en: And sought the path to enlightenment.

source: །ཆོས་ཀྱི་རང་བཞིན་རབ་ཏུ་བརྟག་བྱ་བས།
en: He examined the nature of phenomena,

source: །དེར་གནས་བསྐལ་པ་བརྒྱ་ཕྲག་མང་དུ་སྤྱད།
en: Remaining practicing in that way for a hundred kalpas. “He had compassion for beings with no protector

source: །སྡུག་བསྔལ་རྒྱ་མཚོར་ལྷུང་ཞིང་མདོངས་གྱུར་པའི། །འགྲོ་བ་མགོན་མྱེད་ཀུན་ལ་སྙིང་བརྩེ་བས།
en: Who were falling into an ocean of suffering,

source: །ཡང་དག་བྱང་ཆུབ་ལམ་ལ་ཡོངས་བསྒོམས་ནས།
en: And, meditating on the path to true enlightenment,

source: །དེ་ཚེ་དེའི་རྣམ་ཐར་འདི་ཐོབ་བོ། །བསྐལ་པ་དེ་ལ་བདེ་གཤེགས་གང་བྱུང་བ།
en: He attained at that time this liberation.

source: །དེ་དག་ཀུན་ལའང་དགའ་བས་བསྙེན་བཀུར་ནས།
en: “He joyfully honored every one Of the sugatas who appeared in that kalpa,

source: །དེ་དག་ཀུན་ལ་མཆོད་པ་ཆེན་པོ་བྱས།
en: Making great offerings to all of them

source: །ཆོས་ཀྱི་འཁོར་ལོ་ཡོངས་སུ་བཟུང་བར་གྱུར།
en: And possessing their wheels of the Dharma.

source: །དེ་ཡི་འོག་ཏུ་བསྐལ་པ་རྒྱ་མཚོ་རྣམས།
en: “After that, during an ocean of kalpas

source: །ཞིང་མང་རྒྱ་མཚོ་རྡུལ་སྙེད་ཀུན་ལ་ཡང་།
en: As numerous as the atoms in a sea of realms,

source: །རྒྱལ་བ་ཇི་སྙེད་སྐྱེས་པར་གྱུར་པ་དག །རབ་ཏུ་མཆོད་དེ་དེ་དག་བསྙེན་བཀུར་བྱས།
en: He made offerings, and he honored However many jinas appeared.

source: །རྣམ་པར་རྒྱལ་ཞེས་བྱ་བ་ཁོ་མོ་ཡིན།
en: “I was the one named Vijitāvin,

source: །ཉམ་ང་བཙོན་རར་གནས་པའི་བཙོན་མཐོང་ནས།
en: Who saw the prisoners in the dreadful prison,

source: །དེ་དག་དགྲོལ་ཕྱིར་ལུས་ཀྱང་ཡོངས་སུ་བཏང་།
en: Offered up his body in order to free them,

source: །རྣམ་ཐར་འདི་ཡང་དེ་ཚེ་ཐོབ་པར་གྱུར།
en: And at that time attained this liberation,

source: །ཞིང་རྣམས་རྒྱ་མཚོའི་རྡུལ་ཕྲན་རབ་འགྲངས་པའི།
en: “Who meditated during a great ocean of kalpas

source: །བསྐལ་པ་རྒྱ་མཚོ་མང་པོར་བསྒོམ་པར་བྱས།
en: As numerous as the atoms in an ocean of realms, And who, in each instant, multiplied the ways

source: །ཚུལ་མང་མཐའ་དང་དབུས་མེད་མཉམ་མྱེད་པས། །སྐད་ཅིག་རེ་རེ་དག་ཏུ་རྣམ་པར་སྤེལ།
en: That were unequaled and vast, without end or middle. “I have obtained this liberation

source: །ཐུབ་པའི་བདག་པོ་ཇི་སྙེད་མཐོང་གྱུར་པ།
en: From as many lords of munis as I saw;

source: །དེ་དག་སྤྱན་སྔར་སྔན་ཆད་འདི་ཐོབ་སྟེ།
en: They taught me this liberation

source: །སྒོ་ཚུལ་རྣམ་པ་གཞན་དང་གཞན་དག་གིས། །དེ་དག་གིས་ནི་རྣམ་ཐར་འདི་ཡང་བསྟན། །དེ་དག་རྣམ་ཐར་མ་ནོར་བསམ་ཡས་ལ།
en: Through various ways of entry.

source: །བསྐལ་པ་བྱེ་བ་མང་པོར་ཁོ་མོས་བསླབས།
en: “I trained for many millions of kalpas In this unmistaken, inconceivable liberation I received from them.

source: །དེ་ལ་རྒྱལ་བས་བཀོད་ཅིང་གྲོལ་གྱུར་པ།
en: Established in it by the jinas, I was liberated.

source: །དེ་དག་དམ་ཆོས་སྤྲིན་ལས་ཅིག་ཅར་འཐུང་།
en: I simultaneously drank from their clouds of Dharma. “My bodies pervaded without impediment

source: །ཕྱོགས་བཅུ་ཀུན་གྱི་ཞིང་རྣམས་ཐམས་ཅད་དུ། །ཐོགས་པ་མེད་པར་ལུས་ཀྱིས་རྒྱས་པར་འགེངས།
en: All the realms in all the ten directions.

source: །སྐད་ཅིག་རེ་རེར་ཞིང་རྒྱུད་བསམ་ཡས་པའི།
en: In each instant, I entered countless realms

source: །དུས་གསུམ་རྒྱུད་རྣམས་ཀུན་ལའང་རབ་ཏུ་འཇུག །དུས་གསུམ་རྒྱལ་བ་རྒྱ་མཚོ་མ་ལུས་པ།
en: And entered the divisions of the three times.

source: །རེ་རེ་ཀུན་ལའང་མངོན་དུ་རབ་ཏུ་ལྟ།
en: “They gaze upon each and every one without exception In the ocean of the jinas in the three times. They wander in the presence of the clouds

source: །དེ་དག་ལུས་ཀྱི་གཟུགས་བརྙན་རྒྱལ་བ་ལ། །སྤྲིན་ཏུ་གྱུར་པ་རྣམས་ཀྱང་སྤྱན་སྔར་འགྲིམ།
en: Of the visual images of their bodies.

source: །ཕྱོགས་རྣམས་ཀུན་ཏུ་ཉེ་བར་ཕྱིན་འདོང་ཞིང་།
en: “They go in every direction,

source: །རྒྱལ་བའི་སྤྱན་སྔར་འདོང་བས་ཤིན་ཏུ་མཛེས།
en: Going into the presence of the jinas.

source: །རྒྱན་རྣམས་མ་ལུས་མངོན་པར་ཆར་འབེབས་ཤིང་།
en: They send down a rain of every beautiful display,

source: །རྒྱལ་བ་རྣམས་ལ་དེ་དག་མཆོད་པ་བྱེད།
en: And they offer it to those jinas. “They ask an endless number of all questions

source: །སངས་རྒྱས་རྒྱ་མཚོ་ཆེ་ལ་རྣམ་ཡངས་པའི།
en: To the immense, vast ocean of buddhas.

source: །ཞུ་བ་མཐའ་ཡས་ཀུན་ཀྱང་ཞུ་བ་བྱེད།
en: And they possess all, without exception, of the rain
